modm-ext/archive-stmicro-svd/html_rm0433_stm32h742agi6.svd
        <register>
          <name>HUFFBASE.6</name>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.7</name>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.8</name>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.9</name>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.10</name>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.11</name>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.12</name>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.13</name>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.14</name>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.15</name>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.16</name>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.17</name>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.18</name>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.19</name>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.20</name>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.21</name>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.22</name>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.23</name>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.24</name>
          <addressOffset>0x1f0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.25</name>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.26</name>
          <addressOffset>0x1f8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.27</name>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.28</name>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.29</name>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.30</name>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFBASE.31</name>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{2*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>DATA{2*x+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.0</name>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.1</name>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.2</name>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.3</name>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.4</name>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.5</name>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.6</name>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.7</name>
          <addressOffset>0x22c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.8</name>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.9</name>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.10</name>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.11</name>
          <addressOffset>0x23c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFSYMB.12</name>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATA{4*x}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+1}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+2}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DATA{4*x+3}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
