modm-ext/archive-stmicro-svd/html_rm0433_stm32h742agi6.svd
        <register>
          <name>HUFFENC_AC0.29</name>
          <addressOffset>0x574</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.30</name>
          <addressOffset>0x578</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.31</name>
          <addressOffset>0x57c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.32</name>
          <addressOffset>0x580</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.33</name>
          <addressOffset>0x584</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.34</name>
          <addressOffset>0x588</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.35</name>
          <addressOffset>0x58c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.36</name>
          <addressOffset>0x590</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.37</name>
          <addressOffset>0x594</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.38</name>
          <addressOffset>0x598</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.39</name>
          <addressOffset>0x59c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.40</name>
          <addressOffset>0x5a0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.41</name>
          <addressOffset>0x5a4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.42</name>
          <addressOffset>0x5a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.43</name>
          <addressOffset>0x5ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.44</name>
          <addressOffset>0x5b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.45</name>
          <addressOffset>0x5b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.46</name>
          <addressOffset>0x5b8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.47</name>
          <addressOffset>0x5bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.48</name>
          <addressOffset>0x5c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.49</name>
          <addressOffset>0x5c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.50</name>
          <addressOffset>0x5c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.51</name>
          <addressOffset>0x5cc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.52</name>
          <addressOffset>0x5d0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.53</name>
          <addressOffset>0x5d4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.54</name>
          <addressOffset>0x5d8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.55</name>
          <addressOffset>0x5dc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.56</name>
          <addressOffset>0x5e0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC0.57</name>
          <addressOffset>0x5e4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
