modm-ext/archive-stmicro-svd/html_rm0433_stm32h742agi6.svd
        <register>
          <name>HUFFENC_AC1.28</name>
          <addressOffset>0x6d0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.29</name>
          <addressOffset>0x6d4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.30</name>
          <addressOffset>0x6d8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.31</name>
          <addressOffset>0x6dc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.32</name>
          <addressOffset>0x6e0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.33</name>
          <addressOffset>0x6e4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.34</name>
          <addressOffset>0x6e8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.35</name>
          <addressOffset>0x6ec</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.36</name>
          <addressOffset>0x6f0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.37</name>
          <addressOffset>0x6f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.38</name>
          <addressOffset>0x6f8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.39</name>
          <addressOffset>0x6fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.40</name>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.41</name>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.42</name>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.43</name>
          <addressOffset>0x70c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.44</name>
          <addressOffset>0x710</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.45</name>
          <addressOffset>0x714</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.46</name>
          <addressOffset>0x718</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.47</name>
          <addressOffset>0x71c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.48</name>
          <addressOffset>0x720</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.49</name>
          <addressOffset>0x724</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.50</name>
          <addressOffset>0x728</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.51</name>
          <addressOffset>0x72c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.52</name>
          <addressOffset>0x730</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.53</name>
          <addressOffset>0x734</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.54</name>
          <addressOffset>0x738</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.55</name>
          <addressOffset>0x73c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HUFFENC_AC1.56</name>
          <addressOffset>0x740</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HCODE{2*y}</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y}</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HCODE{2*y+1}</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HLEN{2*y+1}</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
